<?php 

	//Функция перевода русских имен файлов и возможных неподдерживаемых символов в транслит
	function transliteRus($str) {
	    $str = strtolower($str);
	    $tr = array(
		    "А"=>"A","Б"=>"B","В"=>"V","Г"=>"G",
		    "Д"=>"D","Е"=>"E","Ж"=>"J","З"=>"Z","И"=>"I",
		    "Й"=>"Y","К"=>"K","Л"=>"L","М"=>"M","Н"=>"N",
		    "О"=>"O","П"=>"P","Р"=>"R","С"=>"S","Т"=>"T",
		    "У"=>"U","Ф"=>"F","Х"=>"H","Ц"=>"TS","Ч"=>"CH",
		    "Ш"=>"SH","Щ"=>"SCH","Ъ"=>"","Ы"=>"YI","Ь"=>"",
		    "Э"=>"E","Ю"=>"YU","Я"=>"YA","а"=>"a","б"=>"b",
		    "в"=>"v","г"=>"g","д"=>"d","е"=>"e","ж"=>"j",
		    "з"=>"z","и"=>"i","й"=>"y","к"=>"k","л"=>"l",
		    "м"=>"m","н"=>"n","о"=>"o","п"=>"p","р"=>"r",
		    "с"=>"s","т"=>"t","у"=>"u","ф"=>"f","х"=>"h",
		    "ц"=>"ts","ч"=>"ch","ш"=>"sh","щ"=>"sch","ъ"=>"y",
		    "ы"=>"yi","ь"=>"","э"=>"e","ю"=>"yu","я"=>"ya",
		    " "=>"_", "-"=>"_", "+"=>"_", "="=>"_"
	    );
	    return strtr($str,$tr);
	}

	//Используем сокращенную запись доступа к файлу для простоты
	$file = $_FILES['files'];

	//Обрабатываем имя файла, чтобы успешно загрузить его на сервер
	$file_name = transliteRus($file['name']);

	//Задаем максимальный размер загружаемого файла
	$file_size = 4194304;

	// Массив допустимых MIME-типов файлов
	$types = array("image/gif", "image/png", "image/jpeg");

	//Определяем папку для загрузки
	$upload_folder = 'files/';

	// Проверяем наличие папки files, и если её нет, то создаем такую
	if(!file_exists($upload_folder)){
        mkdir($upload_folder, 777);
    }

	// Массив с результатами работы скрипта
	$data = array();

	// Если файл загрузился без ошибок
	if($file['error'] == 0) {
		//Проверка на то, что файл не превышает 2Мб
		if($file['size'] == 0 || $file['size'] > $file_size){
		    $data['status'] = 'Error';
		    $data['mes'] = 'Файл пустой или слишком большой. ';
		    $data['url'] = '';
		} 
		// Проверка на соответствие MIME-типов файлов
		if (!in_array($file['type'], $types)) {
		    $data['status'] = 'Error';
		    $data['mes'] = $data['mes'] . 'Можно загружать только файлы JPG, GIF, PNG форматов. ';
		    $data['url'] = '';
		}
		//Если ошибок до этого не было, то приступаем к загрузке файла
		if (!($data['status'] == 'Error')) {
			if (move_uploaded_file($file['tmp_name'], $upload_folder . $file_name )) {
		        $data['status'] = 'OK';
		        $data['mes'] = "Изображение успешно загружено";
		        $data['name'] = $file['name'];
		        $data['url'] = $upload_folder . $file_name;
		    } // ошибка при перемещении файла
		    else {
		        $data['status'] = 'Error';
		        $data['mes'] = "Возникла неизвестная ошибка при загрузке файла";
		        $data['url'] = '';
		    }
		}
	} else {
		$data['status'] = 'Error';
		$data['mes'] = "Возникла неизвестная ошибка при загрузке файла";
		$data['url'] = '';
	}

	echo json_encode($data);
	exit;
?>